swak4Foam/Examples/DynamicMesh/switchedTJunction/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        //        type zeroGradient;
        //        type            pressureInletOutletVelocity;
        type groovyBC;
        valueExpression "normal()";
        aliases {
            alphaWater alpha.water;
        }
        fractionExpression "alphaWater>0.01 ? 1 : 0";
        value           uniform (0 0 0);
    }
    right
    {
        $left
    }
    inlet
    {
        //        type groovyBC;
        type fixedValue;
        value           uniform (0 -1 0);
        valueExpression "vector(0,alphaWater>0.5 ? -1 : 0,0)";
        //        fractionExpression "alphaWater>0.5 ? 1 : 0.1";
        aliases {
            alphaWater alpha.water;
        }
    }
    defaultFaces
    {
        type            noSlip;
        //        type fixedValue;
        value uniform (0 0 0);
    }
    "ACMI_.*_blockage"
    {
        $defaultFaces;
    }
    "ACMI_.*_couple"
    {
        type  cyclicACMI;
        value uniform (0 0 0);
    }
}


// ************************************************************************* //
