swak4Foam/Examples/DynamicMesh/switchedTJunction/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//           right
//             +-+
//             | |
//             | |
//             | |
//             | |
// +-----------+ |
// |inlet        |
// +-----------+ |
//             | |
//             | |
//             | |
//             | |
//             +-+
//           left

convertToMeters 1;

vertices
(
    (0.0  -0.01 0)   //0
    (0.2  -0.01 0)
    (0.2   0.01 0)   //2
    (0.0   0.01 0)

    (0.22 -0.01 0)  //4
    (0.22  0.01 0)

    (0.23  -0.21 0)  //6
    (0.25  -0.21 0)

    (0.23   0.21 0)  //8
    (0.25   0.21 0)

    // Z
    (0.0  -0.01 0.02)   //0
    (0.2  -0.01 0.02)
    (0.2   0.01 0.02)   //2
    (0.0   0.01 0.02)

    (0.22 -0.01 0.02)  //4
    (0.22  0.01 0.02)

    (0.23  -0.21 0.02)  //6
    (0.25  -0.21 0.02)

    (0.23   0.21 0.02)  //8
    (0.25   0.21 0.02)

    // duplicates for couples

    // on center block
    (0.2  -0.01 0)  // 1 -> 20
    (0.2   0.01 0)  // 2 -> 21
    (0.2  -0.01 0.02)  // 11 -> 22
    (0.2   0.01 0.02)  // 12 -> 23

    // on left block
    (0.22 -0.01 0)  // 4 -> 24
    (0.22 -0.01 0.02)  // 14 -> 25
    (0.2  -0.01 0)  // 20 -> 26
    (0.2  -0.01 0.02)  // 22 -> 27

    // on right block
    (0.22  0.01 0)   // 5 -> 28
    (0.22  0.01 0.02) // 15 -> 29
    (0.2   0.01 0)  // 21 -> 30
    (0.2   0.01 0.02)  // 23 -> 31

);

blocks
(
    // inlet block
    hex (0 1 2 3  10 11 12 13) inletBlock (100 10 10) simpleGrading (1 1 1)

    // central block
    hex (20 4 5 21  22 14 15 23) centralBlock (10 10 10) simpleGrading (1 1 1)

    // left block
    hex (6 7 24 26  16 17 25 27) leftBlock (10 100 10) simpleGrading (1 1 1)

    // right block
    hex (30 28 9 8  31 29 19 18) rightBlock (10 100 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 10 13 3)
        );
    }

    coupleInletCenter
    {
        type patch;
        faces
        (
            (1 11 12 2)
        );
    }
    coupleCenterInlet
    {
        type patch;
        faces
            (
                (20 22 23 21)
            );
    }

    left
    {
        type patch;
        faces
            (
                (6 7 17 16)
            );
    }
    coupleLeftCenter
    {
        type patch;
        faces
            (
                (24 26 25 27)
            );
    }
    coupleCenterLeft
    {
        type patch;
        faces
            (
                (4 20 14 22)
            );
    }

    right
    {
        type patch;
        faces
        (
            (8 18 19 9)
        );
    }

    coupleRightCenter
    {
        type patch;
        faces
            (
                (28 29 31 30)
            );
    }

    coupleCenterRight
    {
        type patch;
        faces
            (
                (5 15 23 21)
            );
    }


    defaultFaces
    {
        type wall;
        faces ();
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
